app/views/users/new.html.erb

SELECT `organizations`.* FROM `organizations`
---
    <%= f.label :organization %><br />
    <%= collection_select(:user, :organization_id, Organization.all, :id, :name) %>