app/views/stories/show.html.erb

<br />
<strong>URL</strong> <%= link_to story_path(@story), @story %> <strong>Articles</strong> <%= @story.articles.count %>
---
SELECT COUNT(*) FROM `articles` WHERE (`articles`.story_id = 1)