app/controllers/albums_controller.rb

SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 1 LIMIT 1
---
  def show
    @album = Album.find(params[:id])

SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 2 ORDER BY stories.created_at DESC LIMIT 1
SELECT `stories`.* FROM `stories` WHERE `stories`.`publication_id` = 1 ORDER BY stories.created_at DESC
---
  def new
    @title = "New Album"
    @album = Album.new
    @id = params[:id]
    if @id
    @story = Story.find(@id)
    else
    @id = current_user.publication_id
    @stories = Story.where(:publication_id => @id)

INSERT INTO `albums` (`description`, `created_at`, `story_id`, `publication_id`, `name`, `user_id`, `article_id`, `updated_at`) VALUES ('', '2011-08-12 03:44:39', NULL, 1, 'Pictures of the game', 106, NULL, '2011-08-12 03:44:39')
---
  def create
    @album = Album.new(params[:album])
    @album.user_id = current_user.id
    @album.publication_id = current_user.publication_id
    if @album.save

SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 2 LIMIT 1
---
  def edit
    @album = Album.find(params[:id])

SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 2 LIMIT 1
---
  def update
     @album = Album.find(params[:id])

DELETE FROM `albums` WHERE `albums`.`id` = 2
SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 2 LIMIT 1
---
  def destroy
    Album.find(params[:id]).destroy