app/controllers/articles_controller.rb

  def new
    @title = "New Article"
    @article = Article.new
    @id = params[:id]
    if @id
    @story = Story.find(@id)
    else
    @id = current_user.publication_id
    @stories = Story.where(:publication_id => @id)
---
SELECT `stories`.* FROM `stories` WHERE `stories`.`id` IS NULL ORDER BY stories.created_at DESC LIMIT 1
SELECT `stories`.* FROM `stories` WHERE `stories`.`publication_id` = 1 ORDER BY stories.created_at DESC

  def create
    @article = Article.new(params[:article])
    @article.publication_id = current_user.publication_id
      if @article.save
---
INSERT INTO `articles` (`content`, `created_at`, `publication_id`, `description`, `name`, `story_id`, `updated_at`, `user_id`) VALUES ('This article should add a new activity.', '2011-08-24 02:25:54', 1, 'Polymorphic', 'Polymorphic Test', 1, '2011-08-24 02:25:54', 102)

  def find_story
    if params[:story_id]
      @story = Story.find_by_id(params[:story_id])
---
SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 2 ORDER BY stories.created_at DESC LIMIT 1

  def destroy
      article = Article.find(params[:id])
      @story = article.story
      article.destroy
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 13 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 13

  def edit
    @title = "Edit Article"
    @article = Article.find(params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 17 LIMIT 1

  def update
      @article = Article.find(params[:id])
      if @article.update_attributes(params[:article])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 17 LIMIT 1
UPDATE `articles` SET `updated_at` = '2011-08-12 01:42:14', `description` = 'f34wef13fed' WHERE `articles`.`id` = 6