app/controllers/microposts_controller.rb

INSERT INTO `microposts` (`user_id`, `created_at`, `content`, `updated_at`) VALUES (102, '2011-08-03 22:31:42', 'This is another test.', '2011-08-03 22:31:42')
---
  def create
    @micropost  = current_user.microposts.build(params[:micropost])
       if @micropost.save