app/controllers/pictures_controller.rb

SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`id` = 1 LIMIT 1
---
  def show
    @picture= Picture.find(params[:id])

INSERT INTO `pictures` (`created_at`, `name`, `user_id`, `album_id`, `article_id`, `updated_at`, `image`, `description`, `organization_id`) VALUES ('2011-08-13 20:04:06', 'Hello', 106, 4, NULL, '2011-08-13 20:04:06', 'icon_linkedin.png', 'rfuh3orewf', NULL)
---
  def create
    @picture = Picture.new(params[:picture])
    @picture.user_id = current_user.id
    if @picture.save

SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`id` = 4 LIMIT 1
---
    def edit
    @picture = Picture.find(params[:id])

SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`id` = 4 LIMIT 1
UPDATE `pictures` SET `updated_at` = '2011-08-13 20:39:16', `description` = 'reqfqrwf' WHERE `pictures`.`id` = 4
---
  def update
     @picture = Picture.find(params[:id])
    if @picture.update_attributes(params[:picture])

SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`id` = 1 LIMIT 1
DELETE FROM `pictures` WHERE `pictures`.`id` = 1
---
  def destroy
    @picture = Picture.find(params[:id])
    @picture.destroy