app/controllers/publications_controller.rb

  def show

    if signed_in?
    @publication = Publication.find(current_user.publication.id)
    @title = @publication.name
    @stories = @publication.stories.paginate(:page => params[:page])
    @activities = @publication.activities.paginate(:page => params[:page])
---
SELECT `publications`.* FROM `publications` WHERE `publications`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `stories` WHERE (`stories`.publication_id = 1)
SELECT `stories`.* FROM `stories` WHERE (`stories`.publication_id = 1) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT `activities`.* FROM `activities` WHERE (`activities`.publication_id = 1) ORDER BY activities.created_at DESC LIMIT 30 OFFSET 0