app/controllers/stories_controller.rb

  def index
    @title = "View Stories"
    @id = current_user.publication_id
    @stories = Story.where(:publication_id => @id)
---
SELECT `stories`.* FROM `stories` WHERE `stories`.`publication_id` = 1 ORDER BY stories.created_at DESC

  def show
    @story = Story.find(params[:id])
---
SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 5 ORDER BY stories.created_at DESC LIMIT 1

  def create
     @story = Story.new(params[:story])
     @story.publication_id = current_user.publication_id
      if @story.save
---
INSERT INTO `stories` (`publication_id`, `creator`, `name`, `updated_at`, `created_at`, `description`) VALUES (1, NULL, 'Rotiki Statue Eats Student', '2011-08-06 02:14:13', '2011-08-06 02:14:13', 'A student was recently eaten by the tiki statue at Rotiki in Branscomb on Friday night.')

  def destroy
      Story.find(params[:id]).destroy
---
DELETE FROM `stories` WHERE `stories`.`id` = 10
SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 10 ORDER BY stories.created_at DESC LIMIT 1

  def edit
    @title = "Edit Story"
    @story = Story.find(params[:id])
---
SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 11 ORDER BY stories.created_at DESC LIMIT 1

  def update
      @story = Story.find(params[:id])
      if @story.update_attributes(params[:story])
---
SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 11 ORDER BY stories.created_at DESC LIMIT 1
UPDATE `stories` SET `description` = 'XXXXX', `updated_at` = '2011-08-06 19:49:33' WHERE `stories`.`id` = 2