app/controllers/users_controller.rb

SELECT `organizations`.* FROM `organizations` WHERE (organization.id = current_user.organization_id)
SELECT `users`.* FROM `users` WHERE `users`.`organization_id` = 1
SELECT `publications`.* FROM `publications` WHERE `publications`.`id` = 1 LIMIT 1
---
  def index
    @title = "All Users"
    @id = current_user.organization_id
    @users = User.where(:organization_id => @id)
    #.paginate(:page => params[:page])
    @publication = Publication.find(:all)

SELECT `users`.* FROM `users` WHERE `users`.`publication_id` IS NULL AND `users`.`organization_id` = 1
---
  def recruits
    @title = "Recruit Users"
    @id = current_user.organization_id
    @users = User.where(:organization_id => @id, :publication_id => nil)

SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO `users` (`updated_at`, `publication_id`, `name`, `admin`, `salt`, `active`, `created_at`, `encrypted_password`, `email`, `organization_id`) VALUES ('2011-08-08 16:44:05', NULL, 'Zach Sherman', 0, 'f3baa1a8a45898673cae70a709a5903c01221feda6f03ab4a2f1d5e3a57eb89d', 0, '2011-08-08 16:44:05', 'ad7c49c1e6c06f53637b076c533e3c07922a9a0c7da758aaab8a9eb3f169c249', 'zach@tritiumstudios.com', 1)
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
UPDATE `users` SET `updated_at` = '2011-07-29 18:39:36', `name` = 'Zach Sherman' WHERE `users`.`id` = 4
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 102 LIMIT 1
UPDATE `users` SET `updated_at` = '2011-08-24 02:06:16', `active` = 1, `encrypted_password` = 'beeac374a7db26d450796c1a325d6056662813c5fae21e2573614f1488eff80c' WHERE `users`.`id` = 3
---
  def approve
    @user = User.find(params[:id])
    if @user.update_attribute(:active, true)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `users` SET `encrypted_password` = '99c886da7d92e02873844703ae603ab0dfc5a6b3eab1dfd0a57506c350c64181', `updated_at` = '2011-08-02 06:42:24' WHERE `users`.`id` = 102
---
  def recruit
    @user = User.find(params[:id])
    @publication = current_user.publication_id
    if @user.update_attribute(:publication_id, @publication)

SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`id` IS NULL LIMIT 1
---
  def find_organization
    @organization = Organization.find_by_id(params[:organization_id])